package com.china.constants;

import java.util.HashMap;
import java.util.Map;

public class InitContacts{

    //存放电话号码与 联系人姓名的映射，置于Map集合中
    private static Map<String, String> cont = null;

    public static Map<String,String> getContact(){
        cont = new HashMap<>();
        cont.put("15307047580", "彭梓雄");
        cont.put("18870424309", "谌祎杰");
        cont.put("18879487552", "肖浩东");
        cont.put("18870422690", "洪莉");
        cont.put("18870420329", "张卿顺");
        cont.put("18870424059", "刘政");
        cont.put("15946982826", "黄文涛");
        cont.put("18870424829", "雷乔");
        cont.put("18870424679", "龚永明");
        cont.put("15779129551", "陈英华");
        cont.put("18870426792", "黄旭");
        cont.put("15779128269", "丁帆");
        cont.put("18870421232", "杨艺");
        cont.put("15350049306", "杨建锋");
        cont.put("18870420286", "肖鹏");
        cont.put("18870422715", "赵庆");
        cont.put("18870424012", "刘丽华");
        cont.put("18379482674", "余凡");
        cont.put("18870424151", "刘秀秀");
        cont.put("15727500684", "张小冬");
        cont.put("15870783646", "高朝红");
        cont.put("15079087108", "陶海洋");
        cont.put("18870420591", "廖深海");
        cont.put("18870421557", "周雅庆");
        cont.put("18870420253", "谢庭");
        cont.put("15779119361", "陈明珠");
        cont.put("15070242997", "刘琪");
        cont.put("18870424092", "程鹏");
        cont.put("15779126872", "麻路璐");
        cont.put("15970184647", "赖搏宇");
        cont.put("18870422771", "张文彬");
        cont.put("18179437645", "何诚");
        cont.put("18870420619", "谢伟华");
        cont.put("17770424094", "吴祖乐");
        cont.put("15779507668", "杨小斌");
        cont.put("18779499052", "李强");
        cont.put("18870423412", "刘波");
        cont.put("18870421309", "蔡轩");
        cont.put("18797945412", "孙志雨");
        cont.put("18870440104", "刘启");
        cont.put("13767672348", "曾寒毓");
        cont.put("18870440164", "崔明亮");
        cont.put("18870421533", "罗钦建");
        cont.put("15679459173", "陈龙");
        cont.put("18870421218", "涂堃");
        cont.put("13367092006", "刘杰文");
        cont.put("15932963862", "林邦华");
        cont.put("18870422601", "袁嫣婷");
        cont.put("15870910492", "夏聪");
        cont.put("18007940441", "张剑锋");
        cont.put("18870421157", "胡逸轩");
        cont.put("18707949366", "金旭");
        cont.put("18870420362", "余冰旎");
        cont.put("18870420702", "马超");
        cont.put("13767230858", "李懿");
        cont.put("18870421507", "朱琳");
        cont.put("15707945187", "吴志茂");
        cont.put("15079124871", "熊茁雯");
        cont.put("15879841006", "李子豪");
        cont.put("18870424020", "苏国剑");
        cont.put("18870420523", "刘春辉");
        cont.put("18870414873", "靳阳阳");
        cont.put("13134035127", "陈炜楠");
        cont.put("18870421195", "熊建邦");
        return  cont;
    }
}
